
[
    {
        "name": "Sourdough banana bread",
        "difficulty": "Intermediate",
        "time": "Hands-on time 10 min. Oven time 1 hour, plus cooling",
        "serving": "Makes 1 loaf (enough to serve 6)",
        "method": "1) Line the loaf tin with baking paper. Mash 3 of the bananas and put in a mixing bowl; slice the remaining banana lengthways and set aside. \n 2) Add the rest of the ingredients to the bowl and mix into a lumpy batter, ensuring there are no patches of dry flour left but trying not to overmix. Spoon the mixture into the lined tin, then sit the sliced banana on top. \n 3) Put the tin in the oven and turn the temperature to 160°C fan/gas 4. Bake for 1 hour, or until a skewer inserted in the centre of the banana bread comes out clean. \n 4) Leave to cool in the tin on a wire rack for 10-15 minutes, then remove the bread from the tin and serve warm or at room temperature.",
        "ingredients": "1) 4 very ripe bananas \n 2) 200g white spelt, wholemeal spelt or plain flour \n 3) 100g sourdough starter \n 4) 50g runny honey \n 5) 50g slightly salted butter, at room temperature \n 6) 1 medium free-range egg \n 7) 7g bicarbonate of soda \n 8) 3.5g baking powder \n 9) 50g pecans or walnuts, whole or halved (optional)"
    }, 
    {
        "name": "Red Cabbage Soup",
        "difficulty": "Easy",
        "time": "50 minutes",
        "serving": "Serves 4",
        "method": "1) Cut the red cabbage into fine strips. Peel and dice the onion. \n 2) Heat the oil in a pan over a medium heat and fry the red cabbage for about 5 minutes. Deglaze with orange juice. \n 3) Add 500ml of water and Knorr Reduced Salt Vegetable Granules. Bring to a boil and cook covered at low to medium heat for about 30 minutes. \n 4) Transfer soup to a blender and blend until smooth. Serve in bowls and top with cream.",
        "ingredients": "1) 400g red cabbage \n 2) 1 onion \n 3) 2 tbsp vegetable oil \n 4) 150ml orange juice \n 5) 2 tsp Knorr Reduced Salt Vegetable Granules \n 6) 500ml water \n 7)50ml soy or oat cream, for cooking"
    }
]